Revit 2027 API
ExporterIFC.GetOrCreateFillPattern Method
 Get (or create) the IfcFillPatternStyle associated with an ElementId.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCAnyHandle GetOrCreateFillPattern(
	ElementId fillPatternId,
	Color color,
	double planScale
)
Public Function GetOrCreateFillPattern (
	fillPatternId As ElementId,
	color As Color,
	planScale As Double
) As IFCAnyHandle
public:
IFCAnyHandle^ GetOrCreateFillPattern(
	ElementId^ fillPatternId,
	Color^ color,
	double planScale
)
member GetOrCreateFillPattern :
        fillPatternId : ElementId *
        color : Color *
        planScale : float -> IFCAnyHandle
Parameters
fillPatternId ElementId
 The fill pattern id.
color Color
 The pattern color.
planScale Double
 The view scale.
Return Value
IFCAnyHandle
 The IfcSurfaceStyle.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace